In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
inputs=df.drop('Survived',axis='columns')
target=df.Survived

In [6]:
dummies=pd.get_dummies(inputs.Sex)

In [8]:
inputs=pd.concat([inputs,dummies],axis='columns')

In [11]:
 
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [12]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [13]:
 
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [21]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [22]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [23]:
model.fit(X_train,y_train)

GaussianNB()

In [24]:
model.score(X_test,y_test)

0.7723880597014925

In [25]:
X_test[0:10]

     Pclass        Age     Fare  female
843       3  34.500000   6.4375       0
79        3  30.000000  12.4750       1
17        2  29.699118  13.0000       0
131       3  20.000000   7.0500       0
209       1  40.000000  31.0000       0
272       2  41.000000  19.5000       1
787       3   8.000000  29.1250       0
171       3   4.000000  29.1250       0
204       3  18.000000   8.0500       0
781       1  17.000000  57.0000       1

In [26]:

y_test[0:10]

843    0
79     1
17     1
131    0
209    1
272    1
787    0
171    0
204    1
781    1
Name: Survived, dtype: int64

In [27]:
model.predict(X_test[0:10])

array([0, 1, 0, 0, 0, 1, 0, 0, 0, 1], dtype=int64)

In [28]:
model.predict_proba(X_test[:10])

array([[0.96986839, 0.03013161],
       [0.42344797, 0.57655203],
       [0.93232843, 0.06767157],
       [0.96242617, 0.03757383],
       [0.76937981, 0.23062019],
       [0.24034556, 0.75965444],
       [0.9371647 , 0.0628353 ],
       [0.92250404, 0.07749596],
       [0.96027694, 0.03972306],
       [0.03147798, 0.96852202]])